const glossary = [
    {
        "id": 1,
        "word": "Веб-приложение",
        "description": "Веб-приложение представляет собой программное приложение, предназначенное для использования через веб-браузер. Оно может быть статическим, динамическим или одностраничным (SPA), обеспечивая пользовательский интерфейс и взаимодействие с сервером через сеть."
    },
    {
        "id": 2,
        "word": "Бандлер",
        "description": "Бандлер - это инструмент веб-разработки, который объединяет и оптимизирует различные файлы и зависимости приложения в один или несколько бандлов (компактных файлов). Это снижает объем данных, передаваемых по сети, и улучшает производительность веб-приложения."
    },
    {
        "id": 3,
        "word": "Webpack",
        "description": "Webpack - мощный сборщик для JavaScript-приложений. Он обеспечивает обширные возможности конфигурации, поддерживает модульную систему, tree shaking и code splitting, а также предоставляет множество плагинов для расширения функциональности."
    },
    {
        "id": 4,
        "word": "Parcel",
        "description": "Parcel - сборщик с нулевой конфигурацией, предназначенный для простого и быстрого старта проектов. Он автоматически обрабатывает различные типы ресурсов, поддерживает code splitting и обладает хорошей производительностью."
    },
    {
        "id": 5,
        "word": "Vite",
        "description": "Vite - современный сборщик, оптимизированный для быстрой разработки. Он использует нативную поддержку ES модулей, обеспечивает мгновенные обновления кода и интегрирован с экосистемой Vue.js."
    },
    {
        "id": 6,
        "word": "HMR",
        "description": "HMR - механизм, позволяющий внести изменения в код приложения в процессе его выполнения, без полной перезагрузки страницы. Это ускоряет разработку, так как изменения видны мгновенно."
    },
    {
        "id": 7,
        "word": "Plugin System",
        "description": "Система плагинов предоставляет возможность расширять функциональность сборщика путем подключения дополнительных модулей. Плагины могут предоставлять различные возможности, от оптимизации кода до автоматической обработки ресурсов."
    },
    {
        "id": 8,
        "word": "DevServer",
        "description": "DevServer - встроенный сервер разработки, предназначенный для локального тестирования приложения в процессе разработки. Он поддерживает HMR и обеспечивает удобное окружение для тестирования."
    },
    {
        "id": 9,
        "word": " Zero-config",
        "description": "Zero-config подход означает использование сборщика без необходимости в явной конфигурации. Это упрощает начало работы с проектом, особенно для новичков в разработке."
    },
    {
        "id": 10,
        "word": "Automatic Asset Resolution",
        "description": "Автоматическое разрешение ресурсов означает, что сборщик самостоятельно определяет и обрабатывает различные типы ресурсов, такие как изображения, стили и шрифты, без необходимости дополнительной конфигурации."
    },
    {
        "id": 11,
        "word": "Broad Language Support",
        "description": "Поддержка различных языков программирования, таких как JavaScript, TypeScript, CSS, HTML, что делает сборщик универсальным инструментом для разнообразных проектов."
    },
    {
        "id": 12,
        "word": "First Development Server",
        "description": "Первый сервер разработки - это встроенный сервер, предоставляющий окружение для быстрого запуска и тестирования веб-приложения в режиме разработки."
    },
    {
        "id": 13,
        "word": "Modern Development",
        "description": "Сборщики, ориентированные на современную разработку, используют новые подходы, такие как нативная поддержка ES модулей, ускоренные времена сборки и оптимизированный процесс разработки."
    },
]

export default glossary;