const glossary = [
    {
        "id": 1,
        "word": "Фронтенд",
        "description": "Фронтенд относится к части веб-разработки, которая занимается созданием пользовательского интерфейса и взаимодействием с пользователем. Это все, что пользователь видит и с чем взаимодействует в браузере."
    },
    {
        "id": 2,
        "word": "Фреймворк",
        "description": "Фреймворк представляет собой структуру и набор инструментов, облегчающих разработку программного обеспечения. В веб-разработке фреймворк может предоставлять готовые решения и структуру для создания веб-приложений."
    },
    {
        "id": 3,
        "word": "Инструменты сборки",
        "description": "Инструменты сборки помогают автоматизировать процесс сборки и развертывания веб-приложений, управлять зависимостями, компилировать код и т. д."
    },
    {
        "id": 4,
        "word": "React",
        "description": "React - это JavaScript-библиотека для создания пользовательских интерфейсов. Он позволяет создавать компоненты, которые обновляются эффективно при изменении данных, и использует виртуальный DOM для оптимизации производительности."
    },
    {
        "id": 5,
        "word": "Vue",
        "description": "Vue.js - это прогрессивный JavaScript-фреймворк для создания пользовательских интерфейсов. Он обеспечивает простоту интеграции и гибкость, позволяя постепенно внедрять его в проект."
    },
    {
        "id": 6,
        "word": "Angular",
        "description": "Angular - это фреймворк разработки веб-приложений, созданный и поддерживаемый командой Angular в Google. Он предоставляет широкий набор инструментов для создания сложных веб-приложений."
    },
    {
        "id": 7,
        "word": "Webpack",
        "description": "Webpack - это инструмент сборки, который позволяет объединять, управлять и оптимизировать ресурсы веб-приложения, такие как JavaScript, стили, изображения и другие."
    },
    {
        "id": 8,
        "word": "Babel",
        "description": "Babel - это транспайлер JavaScript, который позволяет использовать последние версии языка, преобразуя код в совместимый с более старыми браузерами или окружениями JavaScript."
    },
    {
        "id": 9,
        "word": "ReactDOM",
        "description": " ReactDOM - это часть React, предназначенная для манипулирования виртуальным DOM и обновления реального DOM в браузере."
    },
    {
        "id": 10,
        "word": "Redux",
        "description": "Redux - это библиотека управления состоянием в приложениях на основе JavaScript, часто используемая с React. Она помогает организовать и управлять состоянием приложения в одном месте."
    },
    {
        "id": 11,
        "word": "JSX",
        "description": "JSX - это синтаксис расширения JavaScript, используемый в React для описания структуры пользовательского интерфейса в виде элементов, напоминающих HTML."
    },
    {
        "id": 12,
        "word": "Template",
        "description": "Шаблон - это структура, определяющая внешний вид и организацию содержимого веб-страницы или компонента."
    },
    {
        "id": 13,
        "word": "Script",
        "description": "Сценарий (Script) - в контексте веб-разработки это обычно относится к JavaScript-коду, выполняемому на стороне клиента."
    },
    {
        "id": 14,
        "word": "Style",
        "description": "Стиль - это часть веб-разработки, относящаяся к оформлению внешнего вида веб-страницы с использованием CSS или других языков стилей."
    },
    {
        "id": 15,
        "word": "RxJS",
        "description": "RxJS - это библиотека для реактивного программирования в JavaScript. Она предоставляет набор инструментов для работы с асинхронными потоками данных и событиями."
    },
]

export default glossary;